In [7]:
import sqlite3
import pandas as pd

conn = sqlite3.connect("data_input/chinook.db")

In [8]:
emp = pd.read_sql_query("select * from employees", conn)
emp

,EmployeeId,LastName,FirstName,Title,ReportsTo,BirthDate,HireDate,Address,City,State,Country,PostalCode,Phone,Fax,Email
0,1,Adams,Andrew,General Manager,NaN,1962-02-18 00:00:00,2002-08-14 00:00:00,11120 Jasper Ave NW,Edmonton,AB,Canada,T5K 2N1,+1 (780) 428-9482,+1 (780) 428-3457,andrew@chinookcorp.com
1,2,Edwards,Nancy,Sales Manager,1.0,1958-12-08 00:00:00,2002-05-01 00:00:00,825 8 Ave SW,Calgary,AB,Canada,T2P 2T3,+1 (403) 262-3443,+1 (403) 262-3322,nancy@chinookcorp.com
2,3,Peacock,Jane,Sales Support Agent,2.0,1973-08-29 00:00:00,2002-04-01 00:00:00,1111 6 Ave SW,Calgary,AB,Canada,T2P 5M5,+1 (403) 262-3443,+1 (403) 262-6712,jane@chinookcorp.com
3,4,Park,Margaret,Sales Support Agent,2.0,1947-09-19 00:00:00,2003-05-03 00:00:00,683 10 Street SW,Calgary,AB,Canada,T2P 5G3,+1 (403) 263-4423,+1 (403) 263-4289,margaret@chinookcorp.com
4,5,Johnson,Steve,Sales Support Agent,2.0,1965-03-03 00:00:00,2003-10-17 00:00:00,7727B 41 Ave,Calgary,AB,Canada,T3B 1Y7,1 (780) 836-9987,1 (780) 836-9543,steve@chinookcorp.com
5,6,Mitchell,Michael,IT Manager,1.0,1973-07-01 00:00:00,2003-10-17 00:00:00,5827 Bowness Road NW,Calgary,AB,Canada,T3B 0C5,+1 (403) 246-9887,+1 (403) 246-9899,michael@chinookcorp.com
6,7,King,Robert,IT Staff,6.0,1970-05-29 00:00:00,2004-01-02 00:00:00,590 Columbia Boulevard West,Lethbridge,AB,Canada,T1K 5N8,+1 (403) 456-9986,+1 (403) 456-8485,robert@chinookcorp.com
7,8,Callahan,Laura,IT Staff,6.0,1968-01-09 00:00:00,2004-03-04 00:00:00,923 7 ST NW,Lethbridge,AB,Canada,T1H 1Y8,+1 (403) 467-3351,+1 (403) 467-8772,laura@chinookcorp.com

In [17]:
track = pd.read_sql_query("select * from tracks where TrackId = 5", conn)
track

,TrackId,Name,AlbumId,MediaTypeId,GenreId,Composer,Milliseconds,Bytes,UnitPrice
0,5,Princess of the Dawn,3,2,1,Deaffy & R.A. Smith-Diesel,375418,6290521,0.99

In [20]:
genre = pd.read_sql_query(
    '''
        SELECT 
            trk.Name as TrackNm, 
            trk.Composer, 
            trk.UnitPrice, 
            genr.Name as GenreNm, 
            genr.GenreId, 
            trk.TrackId 
        FROM tracks AS trk,     
             genres AS genr 
        WHERE trk.GenreId = genr.GenreId 
              AND trk.TrackId = 5 
              AND genr.GenreId = 1
     ''', conn)
genre.head()

,TrackNm,Composer,UnitPrice,GenreNm,GenreId,TrackId
0,Princess of the Dawn,Deaffy & R.A. Smith-Diesel,0.99,Rock,1,5

In [22]:
pd.read_sql_query("SELECT * FROM media_types", conn)

   MediaTypeId                         Name
0            1              MPEG audio file
1            2     Protected AAC audio file
2            3  Protected MPEG-4 video file
3            4     Purchased AAC audio file
4            5               AAC audio file

In [22]:
ttl_sales = pd.read_sql_query(
    '''
    SELECT 
         inv.BillingCountry AS Country, 
         genr.Name AS Genre, 
         inv.InvoiceDate, 
         SUM(invs.Total) AS Total, 
         AVG(invs.Total) AS avg_inv
    FROM invoices AS invs, 
         invoice_items AS inv_itm, 
         tracks AS trk, 
         genres AS genr, 
         media_types AS med_typ 
    WHERE    invs.InvoiceId = inv_itm.InvoiceId 
         AND inv_itm.TrackId = trk.TrackId 
         AND trk.GenreId = genr.GenreId 
         AND trk.MediaTypeId = med_typ.MediaTypeId 
         AND med_typ.MediaTypeId = 1 
    GROUP BY Genre 
    ORDER BY Total
    '''
    ,conn, parse_dates='InvoiceDate')

ttl_sales['Month'] = ttl_sales["InvoiceDate"].dt.month_name()
ttl_sales

,Country,Genre,InvoiceDate,Total,avg_inv,Month
0,Brazil,Pop,2012-12-07,83.16,13.860000,December
1,USA,Rock And Roll,2012-11-06,83.16,13.860000,November
2,Canada,Bossa Nova,2013-01-30,86.13,5.742000,January
3,USA,Easy Listening,2011-12-01,138.60,13.860000,December
4,Czech Republic,Electronica/Dance,2009-07-11,149.62,12.468333,July
5,USA,Heavy Metal,2010-09-23,161.37,13.447500,September
6,Portugal,World,2012-02-01,166.32,13.860000,February
7,Canada,Hip Hop/Rap,2012-05-04,166.41,9.788824,May
8,Brazil,Soundtrack,2012-12-07,242.55,12.127500,December
9,India,R&B/Soul,2009-07-08,272.25,9.387931,July
10,USA,Reggae,2011-08-30,332.64,11.088000,August
11,Germany,Blues,2011-08-21,429.66,7.043607,August
12,Canada,Jazz,2009-01-06,746.46,9.330750,January
13,USA,Alternative & Punk,2009-01-11,1961.66,8.039590,January
14,Canada,Metal,2009-01-06,2093.13,7.928523,January
15,Sweden,Latin,2012-12-02,3456.69,8.978416,December
16,Italy,Rock,2010-04-13,7268.46,9.402924,April

In [11]:
ttl_sales['month_year'] = pd.to_datetime(ttl_sales['InvoiceDate']).dt.to_period('M')
ttl_sales

,Country,Genre,InvoiceDate,Total,avg_inv,Month,month_year
0,Brazil,Pop,2012-12-07,83.16,13.860000,December,2012-12
1,USA,Rock And Roll,2012-11-06,83.16,13.860000,November,2012-11
2,Canada,Bossa Nova,2013-01-30,86.13,5.742000,January,2013-01
3,USA,Easy Listening,2011-12-01,138.60,13.860000,December,2011-12
4,Czech Republic,Electronica/Dance,2009-07-11,149.62,12.468333,July,2009-07
5,USA,Heavy Metal,2010-09-23,161.37,13.447500,September,2010-09
6,Portugal,World,2012-02-01,166.32,13.860000,February,2012-02
7,Canada,Hip Hop/Rap,2012-05-04,166.41,9.788824,May,2012-05
8,Brazil,Soundtrack,2012-12-07,242.55,12.127500,December,2012-12
9,India,R&B/Soul,2009-07-08,272.25,9.387931,July,2009-07
10,USA,Reggae,2011-08-30,332.64,11.088000,August,2011-08
11,Germany,Blues,2011-08-21,429.66,7.043607,August,2011-08
12,Canada,Jazz,2009-01-06,746.46,9.330750,January,2009-01
13,USA,Alternative & Punk,2009-01-11,1961.66,8.039590,January,2009-01
14,Canada,Metal,2009-01-06,2093.13,7.928523,January,2009-01
15,Sweden,Latin,2012-12-02,3456.69,8.978416,December,2012-12
16,Italy,Rock,2010-04-13,7268.46,9.402924,April,2010-04

In [64]:
ttl_sales['month_year'] = ttl_sales['InvoiceDate'].dt.strftime('%m-%Y')
ttl_sales

          Country             Genre InvoiceDate   Total      Month month_year
0           Chile   Science Fiction  2010-01-13  102.41    January    01-2010
1             USA            Comedy  2012-09-27  112.30  September    09-2012
2             USA  Sci Fi & Fantasy  2012-08-05  198.87     August    08-2012
3  Czech Republic             Drama  2013-11-13  544.61   November    11-2013
4          Sweden          TV Shows  2010-01-10  817.71    January    01-2010

In [65]:
country_sales = pd.read_sql_query(
    '''
    SELECT invs.BillingCountry AS Country, 
           genr.Name AS Genre, 
           med_typ.Name AS Media_Nm, 
           sum(invs.Total) AS Total
    FROM invoices AS invs, 
         invoice_items AS invs_itm, 
         tracks AS trks, 
         genres AS genr, 
         media_types AS med_typ 
    WHERE 
         invs.InvoiceId = invs_itm.InvoiceId 
     AND invs_itm.TrackId = trks.TrackId 
     AND trks.GenreId = genr.GenreId 
     AND trks.MediaTypeId = med_typ.MediaTypeId 
     AND invs.BillingCountry = 'USA'
     GROUP BY Genre 
     ORDER BY Total DESC
    '''
    , conn)
country_sales

   Country               Genre                     Media_Nm    Total
0      USA                Rock              MPEG audio file  1526.14
1      USA               Latin              MPEG audio file   754.67
2      USA               Metal              MPEG audio file   554.45
3      USA  Alternative & Punk              MPEG audio file   415.92
4      USA                Jazz              MPEG audio file   202.95
5      USA            TV Shows  Protected MPEG-4 video file   191.70
6      USA               Drama  Protected MPEG-4 video file   143.16
7      USA               Blues              MPEG audio file   126.72
8      USA              Comedy  Protected MPEG-4 video file    90.44
9      USA           Classical     Protected AAC audio file    87.20
10     USA         Alternative     Protected AAC audio file    79.30
11     USA            R&B/Soul     Protected AAC audio file    75.28
12     USA              Reggae              MPEG audio file    73.26
13     USA    Sci Fi & Fantasy  Protected MPEG-4 video file    71.62
14     USA         Heavy Metal              MPEG audio file    50.49
15     USA          Soundtrack              MPEG audio file    45.54
16     USA          Bossa Nova              MPEG audio file    43.56
17     USA       Rock And Roll              MPEG audio file    41.58
18     USA      Easy Listening              MPEG audio file    41.58
19     USA                 Pop     Protected AAC audio file    33.66
20     USA     Science Fiction  Protected MPEG-4 video file    10.91
21     USA         Hip Hop/Rap              MPEG audio file     6.93

In [25]:
country_sales['Media_Nm'] = country_sales['Media_Nm'].astype('category', errors='raise')
country_sales.dtypes

Country       object
Genre         object
Media_Nm    category
Total        float64
dtype: object

In [26]:
country_sales.head()

  Country               Genre         Media_Nm    Total
0     USA                Rock  MPEG audio file  1526.14
1     USA               Latin  MPEG audio file   754.67
2     USA               Metal  MPEG audio file   554.45
3     USA  Alternative & Punk  MPEG audio file   415.92
4     USA                Jazz  MPEG audio file   202.95

In [64]:
ttl_sales_media = pd.read_sql_query(
    '''
        SELECT invs.BillingCountry AS Country, genr.Name AS Genre, med_typ.Name, SUM(invs.Total) AS Total 
        FROM invoices AS invs, invoice_items AS invs_itm, tracks AS trks, genres AS genr, media_types AS med_typ 
        WHERE     invs.InvoiceId = invs_itm.InvoiceId 
              AND invs_itm.TrackId = trks.TrackId 
              AND trks.GenreId = genr.GenreId 
              AND trks.MediaTypeId = med_typ.MediaTypeId 
              AND med_typ.MediaTypeId = 1 
        GROUP BY Genre 
        ORDER BY Total
    '''
    , conn)
ttl_sales_media

           Country               Genre             Name    Total
0           Brazil                 Pop  MPEG audio file    83.16
1              USA       Rock And Roll  MPEG audio file    83.16
2           Canada          Bossa Nova  MPEG audio file    86.13
3              USA      Easy Listening  MPEG audio file   138.60
4   Czech Republic   Electronica/Dance  MPEG audio file   149.62
5              USA         Heavy Metal  MPEG audio file   161.37
6         Portugal               World  MPEG audio file   166.32
7           Canada         Hip Hop/Rap  MPEG audio file   166.41
8           Brazil          Soundtrack  MPEG audio file   242.55
9            India            R&B/Soul  MPEG audio file   272.25
10             USA              Reggae  MPEG audio file   332.64
11         Germany               Blues  MPEG audio file   429.66
12          Canada                Jazz  MPEG audio file   746.46
13             USA  Alternative & Punk  MPEG audio file  1961.66
14          Canada               Metal  MPEG audio file  2093.13
15          Sweden               Latin  MPEG audio file  3456.69
16           Italy                Rock  MPEG audio file  7268.46

In [33]:
album = pd.read_sql_query(
    '''
    SELECT * FROM albums
    '''
    , conn)
album.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [66]:
total_sls = pd.read_sql_query(
    '''
    SELECT 
        albm.Title AS Album, 
        art.Name AS Artist, 
        sum(inv.Total) AS TotalSales
    FROM
        invoices AS inv, 
        invoice_items AS inv_itm, 
        tracks AS trk, 
        albums AS albm, 
        artists AS art 
     WHERE 
            inv.InvoiceId = inv_itm.InvoiceId 
        AND inv_itm.TrackId = trk.TrackId 
        AND trk.AlbumId = albm.AlbumId 
        AND albm.ArtistId = art.ArtistId 
     GROUP BY albm.Title
     ORDER BY TotalSales DESC
     '''
     , conn)
total_sls.head(10)

,Album,Artist,TotalSales
0,Greatest Hits,Lenny Kravitz,372.51
1,"Lost, Season 2",Lost,290.18
2,"Heroes, Season 1",Heroes,238.61
3,"Lost, Season 1",Lost,223.65
4,"Lost, Season 3",Lost,211.80
5,"Battlestar Galactica, Season 3",Battlestar Galactica,202.80
6,Minha Historia,Chico Buarque,185.13
7,"The Office, Season 3",The Office,170.93
8,Ao Vivo [IMPORT],Zeca Pagodinho,161.74
9,"Battlestar Galactica (Classic), Season 1",Battlestar Galactica (Classic),157.10

In [ ]:
ttl_sales = pd.read_sql_query("")
ttl_sales.head()

In [67]:
emp_sales = pd.read_sql_query(
    '''
    SELECT 
            (empl.FirstName||' '||empl.LastName) AS FullName, 
            sum(invs.Total) AS TotalSales,
            invs.InvoiceDate AS Period 
    FROM 
            employees AS empl, 
            customers AS cust, 
            invoices AS invs 
    WHERE 
                empl.EmployeeId = cust.SupportRepId 
            AND cust.CustomerId = invs.CustomerId 
            AND empl.Title = 'Sales Support Agent' 
    GROUP BY FullName, invs.InvoiceDate
    '''
    , conn, parse_dates='Period')

emp_sales['Period'] = pd.to_datetime(emp_sales['Period']).dt.to_period('M')                         
emp_sales

          FullName  TotalSales   Period
0     Jane Peacock        0.99  2009-01
1     Jane Peacock        1.98  2009-02
2     Jane Peacock        3.96  2009-02
3     Jane Peacock        5.94  2009-02
4     Jane Peacock        8.91  2009-02
..             ...         ...      ...
398  Steve Johnson        0.99  2013-10
399  Steve Johnson        5.94  2013-11
400  Steve Johnson       25.86  2013-11
401  Steve Johnson        1.98  2013-12
402  Steve Johnson        3.96  2013-12

[403 rows x 3 columns]

In [56]:
empl_sales_nm = empl_sales.pivot_table(
    index= "Period",
    values= "TotalSales",
    aggfunc='sum'
).sort_values(by="Period", ascending=True)

#emp_sales_nm.head()
empl_sales_nm['TotalSales'].fillna(0).head()

Period
2009-01    35.64
2009-02    37.62
2009-03    37.62
2009-04    37.62
2009-05    37.62
Freq: M, Name: TotalSales, dtype: float64

In [69]:
emp_total_sales = pd.crosstab(
    index=emp_sales['Period'], 
    columns=emp_sales['FullName'],
    values=emp_sales['TotalSales'],
    aggfunc = 'sum')

emp_total_sales.head()

FullName  Jane Peacock  Margaret Park  Steve Johnson
Period
2009-01           0.99          23.76          10.89
2009-02          20.79           2.97          13.86
2009-03           1.98          13.86          21.78
2009-04          18.81          16.83           1.98
2009-05          10.89           1.98          24.75

In [52]:
emp_total_sales.melt

<bound method DataFrame.melt of FullName  Jane Peacock  Margaret Park  Steve Johnson
Period
2009-01           0.99          23.76          10.89
2009-02          20.79           2.97          13.86
2009-03           1.98          13.86          21.78
2009-04          18.81          16.83           1.98
2009-05          10.89           1.98          24.75
2009-06           1.98          10.89          24.75
2009-07          22.77           3.96          10.89
2009-08          30.69           6.93            NaN
2009-09           0.99          28.71           7.92
2009-10            NaN           7.92          29.70
2009-11           3.96          31.68           1.98
2009-12           9.90          11.88          15.84
2010-01           3.96            NaN          48.66
2010-02          31.77           5.94           8.91
2010-03          34.72           9.90            NaN
2010-04          26.73           1.98           8.91
2010-05           1.98          21.78          13.86
2010-06           5.94          22.77           8.91
2010-07          21.78          15.84            NaN
2010-08          17.82           7.92          11.88
2010-09           7.92          17.82          10.89
2010-10          11.88           9.90          15.84
2010-11          30.69           2.97           3.96
2010-12          26.73           5.94           4.95
2011-01           1.98           8.91          26.73
2011-02          13.86          15.84           7.92
2011-03          19.80          13.86           3.96
2011-04          36.77           6.93           7.92
2011-05           0.99          16.83          24.80
2011-06          11.94          20.83          17.85
2011-07          25.74           9.90           1.98
2011-08          10.89           0.99          25.74
2011-09          21.78           4.95          10.89
2011-10          28.71           5.94           2.97
2011-11           2.97          10.89           9.90
2011-12           8.91           9.90          18.81
2012-01           9.90          16.83          10.89
2012-02           3.96          24.75           8.91
2012-03          10.89          18.81           7.92
2012-04           5.94           1.98          29.70
2012-05          31.68           3.96           1.98
2012-06          10.89          22.77           3.96
2012-07           1.98           1.98          35.66
2012-08           5.94          39.70           1.98
2012-09           9.95          24.82          11.94
2012-10          24.78          10.91           6.93
2012-11           7.92          24.75           4.95
2012-12          22.77           5.94           8.91
2013-01          19.80          15.84           1.98
2013-02          15.84          11.88            NaN
2013-03           5.94          13.86          17.82
2013-04            NaN          33.66            NaN
2013-05           7.92           8.91          20.79
2013-06          34.65            NaN           2.97
2013-07           4.95          18.81          13.86
2013-08          11.88          13.86          11.88
2013-09          10.89          10.89          15.84
2013-10          14.85          19.80           2.97
2013-11           7.92           9.90          31.80
2013-12          21.79          10.89           5.94>

In [60]:
dt_sales = pd.read_sql_query(
    '''
    SELECT 
        (empl.FirstName||' '||empl.LastName) AS FullName, 
        sum(invs.Total) AS TotalSales, 
        invs.BillingCountry AS Country 
    FROM 
        employees AS empl, 
        customers AS cust, 
        invoices AS invs 
    WHERE 
            empl.EmployeeId = +cust.SupportRepId 
        AND cust.CustomerId = +invs.CustomerId 
        AND empl.Title = 'Sales Support Agent' 
    GROUP BY BillingCountry 
    ORDER BY FullName, TotalSales
    '''
    , conn)

dt_sales.head()

       FullName  TotalSales         Country
0  Jane Peacock       41.62         Finland
1  Jane Peacock       45.62         Hungary
2  Jane Peacock       45.62         Ireland
3  Jane Peacock       75.26           India
4  Jane Peacock      112.86  United Kingdom

In [61]:
dt_sales.stack().head(20)

0  FullName        Jane Peacock
   TotalSales             41.62
   Country              Finland
1  FullName        Jane Peacock
   TotalSales             45.62
   Country              Hungary
2  FullName        Jane Peacock
   TotalSales             45.62
   Country              Ireland
3  FullName        Jane Peacock
   TotalSales             75.26
   Country                India
4  FullName        Jane Peacock
   TotalSales            112.86
   Country       United Kingdom
5  FullName        Jane Peacock
   TotalSales            156.48
   Country              Germany
6  FullName        Jane Peacock
   TotalSales             190.1
dtype: object